src/test/java/DoQueryAllSysStatusRequestXML.java

/**
 * Created by Dąbrowscy on 03.06.2017.
 */
public class DoQueryAllSysStatusRequestXML {

    static String request = "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\"><s:Body xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><DoQueryAllSysStatusRequest xmlns=\"https://webapi.allegro.pl/service.php\"><countryId>1</countryId><webapiKey>67e0dedf</webapiKey></DoQueryAllSysStatusRequest></s:Body></s:Envelope>";
}
