spec/support/cassettes/authenticate_and_update_production.yml

---
http_interactions:
- request:
    method: post
    uri: https://webapi.allegro.pl/service.php
    body:
      encoding: US-ASCII
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="https://webapi.allegro.pl/service.php"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:DoQueryAllSysStatusRequest><tns:countryId>1</tns:countryId><tns:webapiKey>{webapi_key}</tns:webapiKey></tns:DoQueryAllSysStatusRequest></env:Body></env:Envelope>
    headers:
      Soapaction:
      - ! '"#doQueryAllSysStatus"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '429'
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 30 Aug 2016 09:39:52 GMT
      Server:
      - Apache
      Vary:
      - Accept-Encoding
      Set-Cookie:
      - ws2=e7898955ec0d0470cc6651cbe46857f0; expires=Tue, 30-Aug-2016 10:09:52 GMT;
        path=/; domain=.allegro.pl
      - ws3=N268c2c0a430befc266aac384d9dea188; expires=Mon, 25-Mar-2115 09:39:52 GMT;
        path=/; domain=.allegro.pl
      - ws4=x; path=/; domain=.allegro.pl
      Content-Length:
      - '1348'
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: US-ASCII
      string: ! '<?xml version="1.0" encoding="UTF-8"?>

        <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:ns1="https://webapi.allegro.pl/service.php"><SOAP-ENV:Body><ns1:doQueryAllSysStatusResponse><ns1:sysCountryStatus><ns1:item><ns1:countryId>1</ns1:countryId><ns1:programVersion>1.0</ns1:programVersion><ns1:catsVersion>1.3.27</ns1:catsVersion><ns1:apiVersion>1.0</ns1:apiVersion><ns1:attribVersion>1.0</ns1:attribVersion><ns1:formSellVersion>1.7.44</ns1:formSellVersion><ns1:siteVersion>1.0</ns1:siteVersion><ns1:verKey>1472468455</ns1:verKey></ns1:item><ns1:item><ns1:countryId>56</ns1:countryId><ns1:programVersion>1.0</ns1:programVersion><ns1:catsVersion>1.0.50</ns1:catsVersion><ns1:apiVersion>1.0</ns1:apiVersion><ns1:attribVersion>1.0</ns1:attribVersion><ns1:formSellVersion>1.0.86</ns1:formSellVersion><ns1:siteVersion>1.0</ns1:siteVersion><ns1:verKey>1471854027</ns1:verKey></ns1:item><ns1:item><ns1:countryId>209</ns1:countryId><ns1:programVersion>1.0</ns1:programVersion><ns1:catsVersion>1.0.68</ns1:catsVersion><ns1:apiVersion>1.0</ns1:apiVersion><ns1:attribVersion>1.0</ns1:attribVersion><ns1:formSellVersion>1.0.81</ns1:formSellVersion><ns1:siteVersion>1.0</ns1:siteVersion><ns1:verKey>1467856103</ns1:verKey></ns1:item></ns1:sysCountryStatus></ns1:doQueryAllSysStatusResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>

'
    http_version: 
  recorded_at: Tue, 30 Aug 2016 09:39:52 GMT
- request:
    method: post
    uri: https://webapi.allegro.pl/service.php
    body:
      encoding: US-ASCII
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="https://webapi.allegro.pl/service.php"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:DoLoginRequest><tns:userLogin>{webapi_login}</tns:userLogin><tns:userPassword>{webapi_password}</tns:userPassword><tns:countryCode>1</tns:countryCode><tns:webapiKey>{webapi_key}</tns:webapiKey><tns:localVersion>1472468455</tns:localVersion></tns:DoLoginRequest></env:Body></env:Envelope>
    headers:
      Soapaction:
      - ! '"#doLogin"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '539'
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 30 Aug 2016 09:39:53 GMT
      Server:
      - Apache
      Vary:
      - Accept-Encoding
      Set-Cookie:
      - QXLDATA=pvNNdK2iPR7gc%2B7xAm38Ws65gdXHFJ7Zm5ukKfXxvzE%3D%23%23%234MTOrcbP3VoCRNYyx6ismeXqbmg9Hhr0q7ypasGLN5cPgrHWLz2Ix8v8VI20mU5MqCEx7qujVfucvoR3E2k70Qy1hFreb6mov4AdGlvyclrzq4aUrqbVKdJXJF41GAr%2FjjgmnmbW5g%3D%3D;
        expires=Tue, 30-Aug-2016 15:39:53 GMT; path=/; domain=.allegro.pl
      - QXLSESSID=0ce5cfc60a3f057ba8161dcf951ab012cadce8a3155a17%2F%2F01; path=/;
        domain=.allegro.pl; HttpOnly
      - _bS=0; expires=Fri, 09-Sep-2016 09:39:53 GMT; path=/; domain=.allegro.pl
      - qeppo_login2=%7B%22welcome%22%3A%22Witaj%2C%22%2C%22id%22%3A%225697909%22%2C%22username%22%3A%22{webapi_login}%22%2C%22fbConnected%22%3Afalse%2C%22qeppo_hash%22%3A%22ZIwd7RPCsGW3%5C%2FOfzBDRHQEb%5C%2FXVMbuYJ4OjFFz9h2r1M%3D%22%2C%22isCompany%22%3Afalse%7D;
        path=/; domain=.allegro.pl
      - qeppo_priv_cookie=ZTQzNQMDDVRcBAo2NTRj; path=/; domain=.allegro.pl
      - ws2=bd7c943b48e0a41b85c80ff746668a37; expires=Tue, 30-Aug-2016 10:09:53 GMT;
        path=/; domain=.allegro.pl
      - ws3=Nefba26e133517abcab0a138e5b28bcee; expires=Mon, 25-Mar-2115 09:39:53 GMT;
        path=/; domain=.allegro.pl
      - ws4=x; path=/; domain=.allegro.pl
      Expires:
      - Thu, 19 Nov 1981 08:52:00 GMT
      Cache-Control:
      - no-store, no-cache, must-revalidate, post-check=0, pre-check=0
      Pragma:
      - no-cache
      Content-Length:
      - '436'
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: US-ASCII
      string: ! '<?xml version="1.0" encoding="UTF-8"?>

        <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:ns1="https://webapi.allegro.pl/service.php"><SOAP-ENV:Body><ns1:doLoginResponse><ns1:sessionHandlePart>0ce5cfc60a3f057ba8161dcf951ab012cadce8a3155a17//01_1</ns1:sessionHandlePart><ns1:userId>5697909</ns1:userId><ns1:serverTime>1472549993</ns1:serverTime></ns1:doLoginResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>

'
    http_version: 
  recorded_at: Tue, 30 Aug 2016 09:39:53 GMT
recorded_with: VCR 2.4.0
